# Parameters
ch: 6
nc: 3  # number of classes

backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

  - [1, 1, Conv, [64, 3, 2]] # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 4-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 6-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 8-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 3, C2f, [1024, True]]

  - [2, 1, Conv, [64, 3, 2]] # 12-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 13-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 15-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 17-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 19-P5/32
  - [-1, 3, C2f, [1024, True]]

  - [[7, 16], 1, Concat, [1]]  # 21 cat backbone P3
  - [[9, 18], 1, Concat, [1]]  # 22 cat backbone P4
  - [[11, 20], 1, Concat, [1]]  # 23 cat backbone P5

  - [-1, 1, SPPF, [1024, 5]] # 24


head:
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 25
  - [[-1, 22], 1, Concat, [1]]  # 26 cat backbone P4
  - [-1, 3, C2f, [512]]  # 27

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 28
  - [[-1, 21], 1, Concat, [1]]  # 29 cat backbone P3
  - [-1, 3, C2f, [256]]  # 30 (P3/8-small)

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]  # 31
  - [[-1, 27], 1, Concat, [1]]  # 32 cat head P4
  - [-1, 3, C2f, [512]]  # 33 (P4/16-medium)

  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]  # 34
  - [[-1, 24], 1, Concat, [1]]  # 35 cat head P5
  - [-1, 3, C2f, [1024]]  # 36 (P5/32-large)

  - [[30, 33, 36], 1, Detect, [nc]]  # 37 Detect(P3, P4, P5)