# VMMFNet-HLAF-LWA with P3–P5 outputs (dual-branch backbone + HLAF + C2f_LWAConv blocks)

# Parameters
ch: 6          # input channels
nc: 3          # number of classes


# Backbone (dual-branch, C2f_LWAConv)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]               # 0
  - [-1, 1, Multiin, [1]]         # 1  (visible branch selector)
  - [-2, 1, Multiin, [2]]         # 2  (multispectral branch selector)

  # Branch 1 (e.g., visible-enhanced)
  - [1, 1, Conv, [64, 3, 2]]      # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 4-P2/4
  - [-1, 3, C2f_LWAConv, [128, True]]   # 5
  - [-1, 1, Conv, [256, 3, 2]]    # 6-P3/8
  - [-1, 6, C2f_LWAConv, [256, True]]   # 7
  - [-1, 1, Conv, [512, 3, 2]]    # 8-P4/16
  - [-1, 6, C2f_LWAConv, [512, True]]   # 9
  - [-1, 1, Conv, [1024, 3, 2]]   # 10-P5/32
  - [-1, 3, C2f_LWAConv, [1024, True]]  # 11

  # Branch 2 (e.g., multispectral-enhanced)
  - [2, 1, Conv, [64, 3, 2]]      # 12-P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 13-P2/4
  - [-1, 3, C2f_LWAConv, [128, True]]   # 14
  - [-1, 1, Conv, [256, 3, 2]]    # 15-P3/8
  - [-1, 6, C2f_LWAConv, [256, True]]   # 16
  - [-1, 1, Conv, [512, 3, 2]]    # 17-P4/16
  - [-1, 6, C2f_LWAConv, [512, True]]   # 18
  - [-1, 1, Conv, [1024, 3, 2]]   # 19-P5/32
  - [-1, 3, C2f_LWAConv, [1024, True]]  # 20

  # Dual-branch fusion at P3/P4/P5
  - [[7, 16], 1, Concat, [1]]     # 21 cat backbone P3
  - [[9, 18], 1, Concat, [1]]     # 22 cat backbone P4
  - [[11, 20], 1, Concat, [1]]    # 23 cat backbone P5

  - [-1, 1, SPPF, [1024, 5]]      # 24 P5 SPPF

# Head (HLAF neck + P3–P5 Detect, C2f_LWAConv in neck)
head:

  - [24, 1, ChannelAttention_HLAF, [4]]                # 25 (P5 high-level HLAF)
  - [-1, 1, nn.Conv2d, [256, 1]]                       # 26  (P5 feature for Detect)
  - [-1, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]]     # 27  (upsample to P4, stride 2)

  # P4 HLAF fusion (backbone P4 + upsampled P5)
  - [22, 1, ChannelAttention_HLAF, [4]]                # 28  (P4 backbone HLAF)
  - [-1, 1, nn.Conv2d, [256, 1]]                       # 29  (P4 backbone proj)
  - [27, 1, ChannelAttention_HLAF, [4, False]]         # 30  (P5-up gating)
  - [[-1, -2], 1, Multiply, []]                        # 31
  - [[-1, 27], 1, Add_HLAF, []]                        # 32
  - [-1, 3, C2f_LWAConv, [256]]                        # 33  P4/16 feature


  - [29, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]]     # 34  (upsample to P3)

  # P3 HLAF fusion (backbone P3 + upsampled P4)
  - [21, 1, ChannelAttention_HLAF, [4]]                # 35  (P3 backbone HLAF)
  - [-1, 1, nn.Conv2d, [256, 1]]                       # 36  (P3 backbone proj)
  - [34, 1, ChannelAttention_HLAF, [4, False]]         # 37  (P4-up gating)
  - [[-1, -2], 1, Multiply, []]                        # 38
  - [[-1, 34], 1, Add_HLAF, []]                        # 39
  - [-1, 3, C2f_LWAConv, [256]]                        # 40  P3/8 feature

  # Detect head: P3, P4, P5
  - [[40, 33, 26], 1, Detect, [nc]]                    # 41 Detect(P3, P4, P5)
